Router>EN
Router#CONF T
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#INT FA1/0
Router(config-if)#IP ADDRESS 192.168.10.0 255.255.255.0
Bad mask /24 for address 192.168.10.0
Router(config-if)#IP ADD 192.168.10.4 255.255.255.0
Router(config-if)#NO SHUT
Router(config-if)#EXIT
Router(config)#EXIT
Router#
%SYS-5-CONFIG_I: Configured from console by console

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to up

Router#CONF T
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ROUTER RIP
Router(config-router)#NETWORK 20.0.0.0
Router(config-router)#NETWORK 10.0.0.0
Router(config-router)#NETWORK 192.168.10.0
Router(config-router)#EXIT
Router(config)#

Switch>EN
Switch#CONF T
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#VLAN 10
Switch(config-vlan)#VLAN 10
Switch(config-vlan)#VLAN 20
Switch(config-vlan)#VLAN 20
Switch(config-vlan)#EXIT
Switch(config)#INT RANGE FA0/1,FA0/3
Switch(config-if-range)#SWITCHPORT ACCESS VLAN10
                                              ^
% Invalid input detected at '^' marker.
	
Switch(config-if-range)#SWITCHPORT ACCESS VLAN 10
Switch(config-if-range)#SWITCHPORT MODE ACCESS
Switch(config-if-range)#EXIT
Switch(config)#INT RANGE FA0/2, FA0/4
Switch(config-if-range)#SWITCHPORT ACCESS VLAN 20
Switch(config-if-range)#SWITCHPORT MODE ACCESS
Switch(config-if-range)#EXIT
Switch(config)#Do Copy Run Start
